mafeiGitHub/stm32Mp3/Bsp/cLcd.cpp
    if (value < 0)
      mFirstLine = 0;
    else if (mLastLine <= (int)mNumDrawLines-1)
      mFirstLine = 0;
    else if (value > mLastLine - mNumDrawLines + 1)
      mFirstLine = mLastLine - mNumDrawLines + 1;
    else
      mFirstLine = value;
    }
  }
//}}}

//{{{
void cLcd::startRender() {

  if (mBuffered) {
    mDrawBuffer = !mDrawBuffer;
    setLayer (0, mBuffer[mDrawBuffer]);

    // frameSync;
    ltdc.frameWait = 1;
    if (osSemaphoreWait (ltdc.sem, 100) != osOK)
      ltdc.timeouts++;
    }

  mDrawStartTime = osKernelSysTick();
  }
//}}}
//{{{
void cLcd::renderCursor (uint32_t colour, int16_t x, int16_t y, int16_t z) {
  ellipse (colour, x, y, z, z);
  }
//}}}
//{{{
void cLcd::endRender() {

  auto y = 0;
  if (mShowTitle && !mTitle.empty()) {
    //{{{  draw title
    text (COL_WHITE, getFontHeight(), mTitle, 0, y, getWidth(), getLineHeight());
    y += getLineHeight();
    }
    //}}}
  if (mShowInfo) {
    //{{{  draw info lines
    if (mLastLine >= 0) {
      // draw scroll bar
      auto yorg = getLineHeight() + ((int)mFirstLine * mNumDrawLines * getLineHeight() / (mLastLine + 1));
      auto height = mNumDrawLines * mNumDrawLines * getLineHeight() / (mLastLine + 1);
      rectClipped (COL_YELLOW, 0, yorg, 8, height);
      }

    auto lastLine = (int)mFirstLine + mNumDrawLines - 1;
    if (lastLine > mLastLine)
      lastLine = mLastLine;
    for (auto lineIndex = (int)mFirstLine; lineIndex <= lastLine; lineIndex++) {
      auto x = 0;
      auto xinc = text (COL_GREEN, getFontHeight(),
                        dec ((mLines[lineIndex].mTime-mStartTime) / 1000) + "." +
                        dec ((mLines[lineIndex].mTime-mStartTime) % 1000, 3, '0'), x, y, getWidth(), getLineHeight());
      x += xinc + 3;
      text (mLines[lineIndex].mColour, getFontHeight(), mLines[lineIndex].mString, x, y, getWidth(), getLineHeight());
      y += getLineHeight();
      }
    }
    //}}}
  if (mShowLcdStats) {
    //{{{  draw lcdStats
    std::string str = dec (ltdc.lineIrq) + ":f " +
                  dec (ltdc.lineTicks) + "ms " +
                      dec (mDma2dHighWater-mDma2dBuf) + ":hi " +
                      dec (mDma2dTimeouts) + " " +
                      dec (ltdc.transferErrorIrq) + " " +
                      dec (ltdc.fifoUnderunIrq);
    text (COL_WHITE, getFontHeight(), str, 0, getHeight() - 2 * getLineHeight(), getWidth(), 24);
    }
    //}}}
  if (mShowFooter)
    //{{{  draw footer
    text (COL_YELLOW, getFontHeight(),
          dec (xPortGetFreeHeapSize()) + " " + dec (osGetCPUUsage()) + "% " + dec (mDrawTime) + "ms",
          0, getHeight()-getLineHeight(), getWidth(), getLineHeight());
    //}}}

  sendWait();
  showLayer (0, mBuffer[mDrawBuffer], 255);

  mDrawTime = osKernelSysTick() - mDrawStartTime;
  }
//}}}

//{{{
void cLcd::displayOn() {

  // enable LTDC
  LTDC->GCR |= LTDC_GCR_LTDCEN;

  // turn on DISP pin
  HAL_GPIO_WritePin (LCD_DISP_GPIO_PORT, LCD_DISP_PIN, GPIO_PIN_SET);        /* Assert LCD_DISP pin */

  // turn on backlight
  HAL_GPIO_WritePin (LCD_BL_CTRL_GPIO_PORT, LCD_BL_CTRL_PIN, GPIO_PIN_SET);  /* Assert LCD_BL_CTRL pin */
  }
//}}}
//{{{
void cLcd::displayOff() {

  // disable LTDC
  LTDC->GCR &= ~LTDC_GCR_LTDCEN;

  // turn off DISP pin
  HAL_GPIO_WritePin (LCD_DISP_GPIO_PORT, LCD_DISP_PIN, GPIO_PIN_RESET);      /* De-assert LCD_DISP pin */

  // turn off backlight
  HAL_GPIO_WritePin (LCD_BL_CTRL_GPIO_PORT, LCD_BL_CTRL_PIN, GPIO_PIN_RESET);/* De-assert LCD_BL_CTRL pin */
  }
//}}}

// iDraw
//{{{
void cLcd::pixel (uint32_t colour, int16_t x, int16_t y) {

  if (mBuffered)
    rect (colour, x, y, 1, 1);
  else
    *(uint32_t*)(curFrameBufferAddress + (y*getWidth() + x)*4) = colour;
  }
//}}}
//{{{
void cLcd::rect (uint32_t colour, int16_t x, int16_t y, uint16_t width, uint16_t height) {

  if (mBuffered) {
    *mDma2dCurBuf++ = colour;                                             // colour
    *mDma2dCurBuf++ = curFrameBufferAddress + ((y * getWidth()) + x) * 4; // fb start address
    *mDma2dCurBuf++ = getWidth() - width;                                 // stride
    *mDma2dCurBuf++ = (width << 16) | height;                             // width:height
    *mDma2dCurBuf++ = 0;                                                  // terminate
    *(mDma2dCurBuf-6) = kWipe;                                            // fill opCode

    if (mDma2dCurBuf > mDma2dHighWater)
      mDma2dHighWater = mDma2dCurBuf;
    }

  else {
    DMA2D->OCOLR = colour;
    DMA2D->OMAR  = curFrameBufferAddress + ((y * getWidth()) + x) * 4;
    DMA2D->OOR   = getWidth() - width;
    DMA2D->NLR   = (width << 16) | height;
    DMA2D->CR = DMA2D_R2M | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;
    while (!(DMA2D->ISR & DMA2D_ISR_TCIF)) {}
    DMA2D->IFCR |= DMA2D_IFSR_CTEIF | DMA2D_IFSR_CTCIF | DMA2D_IFSR_CTWIF|
                   DMA2D_IFSR_CCAEIF | DMA2D_IFSR_CCTCIF | DMA2D_IFSR_CCEIF;
    }

  }
//}}}
//{{{
void cLcd::stamp (uint32_t colour, uint8_t* src, int16_t x, int16_t y, uint16_t width, uint16_t height) {

  if (mBuffered) {
    *mDma2dCurBuf++ = colour;                                             // colour
    *mDma2dCurBuf++ = curFrameBufferAddress + ((y * getWidth()) + x) * 4; // bgnd fb start address
    *mDma2dCurBuf++ = getWidth() - width;                                 // stride
    *mDma2dCurBuf++ = (width << 16) | height;                             // width:height
    *mDma2dCurBuf++ = (uint32_t)src;                                      // src start address
    *mDma2dCurBuf++ = 0;                                                  // terminate
    *(mDma2dCurBuf-7) = kStamp;                                           // stamp opCode

    if (mDma2dCurBuf > mDma2dHighWater)
      mDma2dHighWater = mDma2dCurBuf;
    }

  else {
    DMA2D->FGCOLR = colour;
    DMA2D->OMAR   = curFrameBufferAddress + ((y * getWidth()) + x) * 4;
    DMA2D->BGMAR  = curFrameBufferAddress + ((y * getWidth()) + x) * 4;
    DMA2D->OOR    = getWidth() - width;
    DMA2D->BGOR   = getWidth() - width;
    DMA2D->NLR    = (width << 16) | height;
    DMA2D->FGMAR  = (uint32_t)src;
    DMA2D->CR = DMA2D_M2M_BLEND | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;
    while (!(DMA2D->ISR & DMA2D_ISR_TCIF)) {}
    DMA2D->IFCR |= DMA2D_IFSR_CTEIF | DMA2D_IFSR_CTCIF | DMA2D_IFSR_CTWIF|
                   DMA2D_IFSR_CCAEIF | DMA2D_IFSR_CCTCIF | DMA2D_IFSR_CCEIF;
    }
  }
//}}}
//{{{
int cLcd::text (uint32_t colour, int fontHeight, std::string str, int16_t x, int16_t y, uint16_t width, uint16_t height) {

